routes/web.php

SELECT count(*) as aggregate FROM `pest_and_disease` WHERE `validation_status` = 'pending' and not exists (SELECT * FROM `admin_record_views` WHERE `record_id` = `pest_and_disease`.`case_id` and `record_type` = 'pest_disease' and `user_id` = 1)
SELECT count(*) as aggregate FROM `soil_analysis` WHERE `validation_status` = 'pending' and not exists (SELECT * FROM `admin_record_views` WHERE `record_id` = `soil_analysis`.`id` and `record_type` = 'soil_analysis' and `user_id` = 8)
---
})->name('app.download');

// Lightweight endpoint for sidebar badge polling (unviewed by current user)
Route::get('/admin/api/pending-detections-count', function () {
    $userId = auth()->id();
    $count = PestAndDisease::where('validation_status', 'pending')
        ->whereNotExists(function ($q) use ($userId) {
            $q->from('admin_record_views')
                ->whereColumn('record_id', 'pest_and_disease.case_id')
                ->where('record_type', 'pest_disease')
                ->where('user_id', $userId);
        })
        ->count();
    return response()->json(['count' => $count]);
})->middleware(['web', 'auth'])->name('admin.pending-count');

// Lightweight endpoint for Soil Analysis sidebar badge polling (unviewed by current user)
Route::get('/admin/api/pending-soil-count', function () {
    $userId = auth()->id();
    $count = SoilAnalysis::where('validation_status', 'pending')
        ->whereNotExists(function ($q) use ($userId) {
            $q->from('admin_record_views')
                ->whereColumn('record_id', 'soil_analysis.id')
                ->where('record_type', 'soil_analysis')
                ->where('user_id', $userId);
        })
        ->count();
    return response()->json(['count' => $count]);
})->middleware(['web', 'auth'])->name('admin.pending-soil-count');

SELECT * FROM `users` WHERE `id` = 8 LIMIT 1
---
Route::impersonate();

// Override the Filament Impersonate leave route with a working implementation
Route::get('/filament-impersonate/leave', function () {
    auth()->user()->leaveImpersonation();
    return redirect('/admin/users');
})->name('filament-impersonate.leave')->middleware('web');