app/Filament/Traits/HasFarmerInfoComponents.php

                                    ->hidden()
                                    ->disabled(),

                                    Select::make('municipality')
                                    ->label('Municipality')
                                    ->required()
                                    ->options(\App\Models\Municipality::whereNotNull('code')->pluck('municipality', 'code'))
                                    ->reactive()
                                    ->searchable()
                                    ->afterStateUpdated(fn (callable $set) => $set('barangay', null)),
---
SELECT `municipality`, `code` FROM `municipalities` WHERE `code` IS not NULL