app/Filament/Traits/HasFarmInfoComponents.php

    public function Step_FarmInfo(?Farm $farm = null, ?bool $is_signup = false): Step
    {



                    return
                    Step::make('FarmInfo')
                    ->label(new HtmlString('<span class="sm:whitespace-normal md:whitespace-pre-line md:inline">Farm Information</span>'))
                    ->icon('heroicon-o-chevron-up')
                    // ->description('Enter your Personal Details')
                    ->completedIcon('heroicon-m-hand-thumb-up')

                    ->schema([

                            Tabs::make('Farm Information')

                                ->tabs([
                                    Tab::make('B.1.Farm Location')
                                    ->columns([
                                        'md' => 1,  // normal medium monitor
                                        'lg' => 2,  // my small monitor
                                        '2xl' => 3, // my large monitor
                                    ])
                                    ->schema([
                                        TextInput::make('lot_hectare')->required(),


                                        Select::make('province')
                                    ->options([
                                        'Davao de Oro' => 'Davao de Oro', // The key must match the default value
                                        'Davao del Sur' => 'Davao del Sur',
                                    ])
                                    ->default('Davao de Oro')
                                    ->hidden()
                                    ->disabled(),

                                    // Select::make('municipality')
                                    // ->label('Municipality')
                                    // ->required()
                                    // ->options(\App\Models\Municipality::whereNotNull('code')->pluck('municipality', 'code'))
---
SELECT `municipality`, `code` FROM `municipalities` WHERE `code` IS not NULL