app/Http/Controllers/PestAndDiseaseController.php

SELECT * FROM `pest_disease_expert_comments` WHERE `pest_and_disease_id` = 1 ORDER BY `created_at` ASC
---
    private function formatDetection($detection)
    {
        // Load extra expert comments
        $extraComments = \App\Models\PestDiseaseExpertComment::with('expert.agriculturalProfessional')
            ->where('pest_and_disease_id', $detection->case_id)
            ->orderBy('created_at', 'asc')
            ->get()
            ->map(function ($c) {
                $agency = $c->expert?->agriculturalProfessional?->agency;
                return [
                    'id'              => $c->id,
                    'sender_type'     => 'expert',
                    'sender_name'     => $c->expert?->name ?? 'Expert',
                    'agency'          => $agency,
                    'agency_label'    => $agency ? "Expert from {$agency}" : null,
                    'message'         => $c->message,
                    'created_at'      => $c->created_at->toISOString(),
                    'is_initial'      => false,
                    'is_extra_comment' => true,
                ];
            });