app/Http/Controllers/PestAndDiseaseController.php

SELECT * FROM `pest_and_disease` WHERE `pest_and_disease`.`case_id` = '1' LIMIT 1
---
    public function checkValidationStatus(Request $request)
    {
        $ids = $request->input('ids', []);

        if (empty($ids)) {
            return response()->json([
                'message' => 'No IDs provided',
                'data' => [],
            ]);
        }

        $detections = PestAndDisease::with('validator:id,name')
            ->whereIn('case_id', $ids)
            ->get()
            ->map(function ($detection) {
                return [
                    'case_id' => $detection->case_id,
                    'validation_status' => $detection->validation_status,
                    'expert_comments' => $detection->expert_comments,
                    'validated_by' => $detection->validator?->name,
                    'validated_at' => $detection->validated_at?->toISOString(),
                ];
            });