app/Filament/Resources/PestAndDiseaseResource.php

SELECT count(*) as aggregate FROM `pest_and_disease` WHERE `validation_status` = 'pending'
---
    public static function getNavigationBadge(): ?string
    {
        $userId = auth()->id();

        $query = static::getModel()::where('validation_status', 'pending')
            ->whereNotExists(function ($q) use ($userId) {
                $q->from('admin_record_views')
                    ->whereColumn('record_id', 'pest_and_disease.case_id')
                    ->where('record_type', 'pest_disease')
                    ->where('user_id', $userId);
            });

        $user = auth()->user();
        if ($user && $user->isAgriculturalProfessional()) {
            $professional = $user->agriculturalProfessional;
            if ($professional && $professional->agency === 'MAGRO' && $professional->municipality) {
                $appNos = \App\Models\Farmer::where('municipality', $professional->municipality)
                    ->pluck('app_no');
                $query->whereIn('app_no', $appNos);
            }
        }

        $count = $query->count();