app/Filament/Resources/SoilAnalysisResource.php

SELECT * FROM `farms` WHERE `farms`.`id` = 2 LIMIT 1
---
                    ]),
                Tables\Filters\TrashedFilter::make()
                    ->hidden(fn () => !in_array(SoftDeletingScope::class, class_uses_recursive(SoilAnalysis::class))),
            ])
                ->actions([
                    Tables\Actions\ActionGroup::make([
                        Action::make('view')
                            ->label('View Details')
                            ->icon('heroicon-o-eye')
                            ->color('info')
                            ->modalHeading(fn (SoilAnalysis $record) => "Soil Analysis: {$record->farm->name}")
                            ->modalWidth('6xl')
                            ->extraModalWindowAttributes(['class' => 'p-2'])
                            ->modalContent(function (SoilAnalysis $record) {
                                if ($record->validation_status === 'pending') {
                                    AdminRecordView::markViewed(auth()->id(), 'soil_analysis', $record->getKey());
                                }
                                // Mark related header notifications as read
                                auth()->user()?->unreadNotifications()
                                    ->where('data', 'like', '%viewRecord=' . $record->id . '%')
                                    ->update(['read_at' => now()]);
                                return view('filament.resources.soil-analysis.view-modal', ['record' => $record]);
                            })
                            ->modalFooterActions(fn (SoilAnalysis $record, Action $action) => [

                                // ── Expert Recommendation (manual entry) ──
                                Action::make('recommend')
                                    ->label('Expert Recommendation')
                                    ->icon('heroicon-o-star')
                                    ->color('info')
                                    ->size('lg')
                                    ->extraAttributes(['class' => 'px-8 py-3 mx-2'])
                                    ->form([
                                        Forms\Components\Select::make('validation_status')