app/Filament/Resources/SoilAnalysisResource.php

    public static function getNavigationBadge(): ?string
    {
        $userId = auth()->id();

        $count = \Illuminate\Support\Facades\Cache::remember("soil_badge_{$userId}", 15, function () use ($userId) {
            return static::getModel()::where('validation_status', 'pending')
                ->whereNotExists(function ($q) use ($userId) {
                    $q->from('admin_record_views')
                        ->whereColumn('record_id', 'soil_analysis.id')
                        ->where('record_type', 'soil_analysis')
                        ->where('user_id', $userId);
                })
                ->count();
        });
---
SELECT count(*) as aggregate FROM `soil_analysis` WHERE `validation_status` = 'pending'

    public static function form(Form $form): Form
    {
        return $form->schema([
            Tabs::make('SoilAnalysisTabs')
                ->tabs([
                    // ————————————————————— Farmer / Farm —————————————————————
                    Tab::make('Farmer & Farm')
                        ->schema([
                            Forms\Components\Hidden::make('farmer_id')
                                ->dehydrated(true),

                            // Preload farm data for instant client-side population
                            Placeholder::make('_farm_data_loader')
                                ->hiddenLabel()
                                ->columnSpanFull()
                                ->extraAttributes(['class' => 'hidden'])
                                ->content(function () {
                                    $json = \App\Models\Farm::with('farmer:id,last_name')
                                        ->get(['id', 'farm_name', 'soil_type', 'latitude', 'longtitude'])
                                        ->keyBy('id')
                                        ->map(fn ($f) => [
                                            'farm_name'        => $f->farm_name ?? '',
                                            'soil_type'        => $f->soil_type ?? '',
                                            'location'         => ($f->latitude && $f->longtitude) ? "{$f->latitude}, {$f->longtitude}" : '',
                                        ])
                                        ->toJson(JSON_HEX_TAG | JSON_HEX_APOS | JSON_HEX_QUOT | JSON_HEX_AMP);
---
SELECT * FROM `farmers` WHERE `farmers`.`id` in (1)

                    ]),
                Tables\Filters\TrashedFilter::make()
                    ->hidden(fn () => !in_array(SoftDeletingScope::class, class_uses_recursive(SoilAnalysis::class))),
            ])
                ->actions([
                    Tables\Actions\ActionGroup::make([
                        Action::make('view')
                            ->label('View Details')
                            ->icon('heroicon-o-eye')
                            ->color('info')
                            ->modalHeading(fn (SoilAnalysis $record) => "Soil Analysis: {$record->farm->name}")
                            ->modalWidth('6xl')
                            ->extraModalWindowAttributes(['class' => 'p-2'])
                            ->modalContent(function (SoilAnalysis $record) {
                                if ($record->validation_status === 'pending') {
                                    AdminRecordView::markViewed(auth()->id(), 'soil_analysis', $record->getKey());
                                }
                                // Mark related header notifications as read
                                auth()->user()?->unreadNotifications()
                                    ->where('data', 'like', '%viewRecord=' . $record->id . '%')
                                    ->update(['read_at' => now()]);
                                return view('filament.resources.soil-analysis.view-modal', ['record' => $record]);
                            })
                            ->modalFooterActions(fn (SoilAnalysis $record, Action $action) => [

---
SELECT * FROM `farms` WHERE `farms`.`id` = 1346 LIMIT 1
UPDATE `notifications` SET `read_at` = '2026-04-02 06:31:00', `notifications`.`updated_at` = '2026-04-02 06:31:00' WHERE `notifications`.`notifiable_type` = 'App\\Models\\User' and `notifications`.`notifiable_id` = 8 and `notifications`.`notifiable_id` IS not NULL and `read_at` IS NULL and `data` like '%viewRecord=40%' ORDER BY `created_at` DESC