app/Models/AdminRecordView.php

    public static function hasViewed(int $userId, string $recordType, int $recordId): bool
    {
        return static::where('user_id', $userId)
            ->where('record_type', $recordType)
            ->where('record_id', $recordId)
            ->exists();
---
SELECT exists(SELECT * FROM `admin_record_views` WHERE `user_id` = 4 and `record_type` = 'soil_analysis' and `record_id` = 29) as `exists`